FIO-tests-11-56-04-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1609761463,
  "timestamp_ms" : 1609761463131,
  "time" : "Mon Jan  4 11:57:43 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 727437312,
        "io_kbytes" : 710388,
        "bw_bytes" : 24247102,
        "bw" : 23678,
        "iops" : 5919.702677,
        "runtime" : 30001,
        "total_ios" : 177597,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 37941,
          "max" : 14395151,
          "mean" : 110082.267966,
          "stddev" : 147743.204653
        },
        "clat_ns" : {
          "min" : 2019,
          "max" : 10570062,
          "mean" : 56595.556451,
          "stddev" : 124861.024475,
          "percentile" : {
            "1.000000" : 2096,
            "5.000000" : 2128,
            "10.000000" : 2160,
            "20.000000" : 2224,
            "30.000000" : 2256,
            "40.000000" : 2288,
            "50.000000" : 2352,
            "60.000000" : 2448,
            "70.000000" : 126464,
            "80.000000" : 134144,
            "90.000000" : 179200,
            "95.000000" : 187392,
            "99.000000" : 228352,
            "99.500000" : 254976,
            "99.900000" : 440320,
            "99.950000" : 1122304,
            "99.990000" : 5603328
          }
        },
        "lat_ns" : {
          "min" : 121206,
          "max" : 14404955,
          "mean" : 167234.693908,
          "stddev" : 174955.463591
        },
        "bw_min" : 11961,
        "bw_max" : 25044,
        "bw_agg" : 80.424080,
        "bw_mean" : 19042.813559,
        "bw_dev" : 1637.817234,
        "bw_samples" : 59,
        "iops_min" : 2990,
        "iops_max" : 6261,
        "iops_mean" : 4760.322034,
        "iops_stddev" : 409.437143,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.716667,
      "sys_cpu" : 67.823333,
      "ctx" : 61932,
      "majf" : 0,
      "minf" : 14,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 65.840639,
        "10" : 0.311942,
        "20" : 0.085587,
        "50" : 0.028717,
        "100" : 0.043357,
        "250" : 33.143578,
        "500" : 0.457215,
        "750" : 0.016329,
        "1000" : 0.019144
      },
      "latency_ms" : {
        "2" : 0.016329,
        "4" : 0.018018,
        "10" : 0.018018,
        "20" : 0.010000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1781653504,
        "io_kbytes" : 1739896,
        "bw_bytes" : 59386470,
        "bw" : 57994,
        "iops" : 14498.650045,
        "runtime" : 30001,
        "total_ios" : 434974,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4217,
          "max" : 11455346,
          "mean" : 50692.562342,
          "stddev" : 139107.020079
        },
        "clat_ns" : {
          "min" : 4749,
          "max" : 23258549,
          "mean" : 499667.152570,
          "stddev" : 500229.683872,
          "percentile" : {
            "1.000000" : 89600,
            "5.000000" : 90624,
            "10.000000" : 193536,
            "20.000000" : 211968,
            "30.000000" : 317440,
            "40.000000" : 391168,
            "50.000000" : 464896,
            "60.000000" : 544768,
            "70.000000" : 585728,
            "80.000000" : 610304,
            "90.000000" : 765952,
            "95.000000" : 946176,
            "99.000000" : 2670592,
            "99.500000" : 3293184,
            "99.900000" : 7110656,
            "99.950000" : 8847360,
            "99.990000" : 11468800
          }
        },
        "lat_ns" : {
          "min" : 124955,
          "max" : 23263685,
          "mean" : 550727.883209,
          "stddev" : 509704.547432
        },
        "bw_min" : 21424,
        "bw_max" : 67376,
        "bw_agg" : 99.806292,
        "bw_mean" : 57881.661017,
        "bw_dev" : 12915.563204,
        "bw_samples" : 59,
        "iops_min" : 5356,
        "iops_max" : 16844,
        "iops_mean" : 14470.372881,
        "iops_stddev" : 3228.885010,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 5.356667,
      "sys_cpu" : 73.773333,
      "ctx" : 42126,
      "majf" : 0,
      "minf" : 23,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998391,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999770,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.010000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 7.924382,
        "250" : 16.385577,
        "500" : 32.135254,
        "750" : 33.150717,
        "1000" : 6.205198
      },
      "latency_ms" : {
        "2" : 2.966154,
        "4" : 0.933159,
        "10" : 0.274269,
        "20" : 0.023220,
        "50" : 0.010000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 610041,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 102277,
      "write_ticks" : 0,
      "in_queue" : 680,
      "util" : 99.383321
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=296: Mon Jan  4 11:57:43 2021
  read: IOPS=5919, BW=23.1MiB/s (24.2MB/s)(694MiB/30001msec)
    slat (usec): min=37, max=14395, avg=110.08, stdev=147.74
    clat (usec): min=2, max=10570, avg=56.60, stdev=124.86
     lat (usec): min=121, max=14404, avg=167.23, stdev=174.96
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  127], 80.00th=[  135], 90.00th=[  180], 95.00th=[  188],
     | 99.00th=[  229], 99.50th=[  255], 99.90th=[  441], 99.95th=[ 1123],
     | 99.99th=[ 5604]
   bw (  KiB/s): min=11961, max=25044, per=80.42%, avg=19042.81, stdev=1637.82, samples=59
   iops        : min= 2990, max= 6261, avg=4760.32, stdev=409.44, samples=59
  lat (usec)   : 4=65.84%, 10=0.31%, 20=0.09%, 50=0.03%, 100=0.04%
  lat (usec)   : 250=33.14%, 500=0.46%, 750=0.02%, 1000=0.02%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.02%, 20=0.01%
  cpu          : usr=3.72%, sys=67.82%, ctx=61932, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=177597,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=298: Mon Jan  4 11:57:43 2021
  read: IOPS=14.5k, BW=56.6MiB/s (59.4MB/s)(1699MiB/30001msec)
    slat (usec): min=4, max=11455, avg=50.69, stdev=139.11
    clat (usec): min=4, max=23258, avg=499.67, stdev=500.23
     lat (usec): min=124, max=23263, avg=550.73, stdev=509.70
    clat percentiles (usec):
     |  1.00th=[   90],  5.00th=[   91], 10.00th=[  194], 20.00th=[  212],
     | 30.00th=[  318], 40.00th=[  392], 50.00th=[  465], 60.00th=[  545],
     | 70.00th=[  586], 80.00th=[  611], 90.00th=[  766], 95.00th=[  947],
     | 99.00th=[ 2671], 99.50th=[ 3294], 99.90th=[ 7111], 99.95th=[ 8848],
     | 99.99th=[11469]
   bw (  KiB/s): min=21424, max=67376, per=99.81%, avg=57881.66, stdev=12915.56, samples=59
   iops        : min= 5356, max=16844, avg=14470.37, stdev=3228.89, samples=59
  lat (usec)   : 10=0.01%, 100=7.92%, 250=16.39%, 500=32.14%, 750=33.15%
  lat (usec)   : 1000=6.21%
  lat (msec)   : 2=2.97%, 4=0.93%, 10=0.27%, 20=0.02%, 50=0.01%
  cpu          : usr=5.36%, sys=73.77%, ctx=42126, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=434974,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=23.1MiB/s (24.2MB/s), 23.1MiB/s-23.1MiB/s (24.2MB/s-24.2MB/s), io=694MiB (727MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=56.6MiB/s (59.4MB/s), 56.6MiB/s-56.6MiB/s (59.4MB/s-59.4MB/s), io=1699MiB (1782MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=610041/1, merge=0/0, ticks=102277/0, in_queue=680, util=99.38%